app/controllers/deposits_controller.rb

  def index
    @deposits = Deposit.all
---
SELECT * FROM "deposits"

  def show
    @deposit = Deposit.find(params[:id])
---
SELECT * FROM "deposits" WHERE ("deposits"."id" = 980190963)

  def create
    @deposit = Deposit.new(params[:deposit])

    respond_to do |format|
      if @deposit.save
---
INSERT INTO "deposits" ("updated_at", "date", "dr", "cr", "bank_id", "created_at") VALUES('2010-07-26 15:20:30', '2010-07-01', 1.0, 0.0, 1, '2010-07-26 15:20:30')