app/controllers/paid_in_capitals_controller.rb

  def index
    @paid_in_capitals = PaidInCapital.all
---
SELECT * FROM "paid_in_capitals"