app/controllers/receivables_controller.rb

SELECT * FROM "receivables"
---
  def index
    @receivables = Receivable.all