app/controllers/short_term_debts_controller.rb

SELECT * FROM "short_term_debts"
---
  def index
    @short_term_debts = ShortTermDebt.all